/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_itoa.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhawkgir <dhawkgir@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/17 16:57:42 by dhawkgir          #+#    #+#             */
/*   Updated: 2021/10/19 10:53:09 by dhawkgir         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Функция ft_itoa распределяет (с помощью malloc) и возвращает «свежую» строку,
заканчивающуюся на \0, представляющую целое число n,
заданное в качестве аргумента. Подерживаются отрицательные числа.
Если распределение завершается неудачно, функция возвращает NULL.
*/
#include "libft.h"

char	*ft_itoa(int n)
{
	
}