/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_split.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhawkgir <dhawkgir@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/17 16:58:10 by dhawkgir          #+#    #+#             */
/*   Updated: 2021/10/21 21:56:51 by dhawkgir         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Функция ft_split выделяет (с помощью malloc) и возвращает массив «свежих» строк
(все заканчивающиеся на \0, включая сам массив),
полученных путем разбиения s с использованием символа c в качестве разделителя.
Если распределение завершается неудачно, функция возвращает NULL. 
*/
#include "libft.h"

char	**ft_split(char const *s, char c)
{
	unsigned int	wrdcnt;
	unsigned int	index;
	char			**strsplit;

	if (!s)
		return (0);
	wrdcnt = 0;
	index = 0;
	
	return (strsplit);
}
